TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_debugss.h
/* DEBUGSS_ISET Bits */
/* DEBUGSS_ISET[TXIFG] Bits */
#define DEBUGSS_ISET_TXIFG_OFS                   (0)                             /* !< TXIFG Offset */
#define DEBUGSS_ISET_TXIFG_MASK                  ((uint32_t)0x00000001U)         /* !< Sets TXIFG in RIS register */
#define DEBUGSS_ISET_TXIFG_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ISET_TXIFG_SET                   ((uint32_t)0x00000001U)         /* !< RIS bit corresponding to TXIFG is
                                                                                    set */
/* DEBUGSS_ISET[RXIFG] Bits */
#define DEBUGSS_ISET_RXIFG_OFS                   (1)                             /* !< RXIFG Offset */
#define DEBUGSS_ISET_RXIFG_MASK                  ((uint32_t)0x00000002U)         /* !< Sets RXIFG in RIS register */
#define DEBUGSS_ISET_RXIFG_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ISET_RXIFG_SET                   ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to RXIFG is
                                                                                    set */
/* DEBUGSS_ISET[PWRUPIFG] Bits */
#define DEBUGSS_ISET_PWRUPIFG_OFS                (2)                             /* !< PWRUPIFG Offset */
#define DEBUGSS_ISET_PWRUPIFG_MASK               ((uint32_t)0x00000004U)         /* !< Sets PWRUPIFG in RIS register */
#define DEBUGSS_ISET_PWRUPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ISET_PWRUPIFG_SET                ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to PWRUPIFG
                                                                                    is set */
/* DEBUGSS_ISET[PWRDWNIFG] Bits */
#define DEBUGSS_ISET_PWRDWNIFG_OFS               (3)                             /* !< PWRDWNIFG Offset */
#define DEBUGSS_ISET_PWRDWNIFG_MASK              ((uint32_t)0x00000008U)         /* !< Sets PWRDWNIFG in RIS register */
#define DEBUGSS_ISET_PWRDWNIFG_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ISET_PWRDWNIFG_SET               ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to PWRUPIFG
                                                                                    is set */

/* DEBUGSS_ICLR Bits */
/* DEBUGSS_ICLR[TXIFG] Bits */
#define DEBUGSS_ICLR_TXIFG_OFS                   (0)                             /* !< TXIFG Offset */
#define DEBUGSS_ICLR_TXIFG_MASK                  ((uint32_t)0x00000001U)         /* !< Clears TXIFG in RIS register */
#define DEBUGSS_ICLR_TXIFG_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ICLR_TXIFG_CLR                   ((uint32_t)0x00000001U)         /* !< RIS bit corresponding to TXIFG is
                                                                                    cleared */
/* DEBUGSS_ICLR[RXIFG] Bits */
#define DEBUGSS_ICLR_RXIFG_OFS                   (1)                             /* !< RXIFG Offset */
#define DEBUGSS_ICLR_RXIFG_MASK                  ((uint32_t)0x00000002U)         /* !< Clears RXIFG in RIS register */
#define DEBUGSS_ICLR_RXIFG_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ICLR_RXIFG_CLR                   ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to RXIFG is
                                                                                    cleared */
/* DEBUGSS_ICLR[PWRUPIFG] Bits */
#define DEBUGSS_ICLR_PWRUPIFG_OFS                (2)                             /* !< PWRUPIFG Offset */
#define DEBUGSS_ICLR_PWRUPIFG_MASK               ((uint32_t)0x00000004U)         /* !< Clears PWRUPIFG in RIS register */
#define DEBUGSS_ICLR_PWRUPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ICLR_PWRUPIFG_CLR                ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to PWRUPIFG
                                                                                    is cleared */
/* DEBUGSS_ICLR[PWRDWNIFG] Bits */
#define DEBUGSS_ICLR_PWRDWNIFG_OFS               (3)                             /* !< PWRDWNIFG Offset */
#define DEBUGSS_ICLR_PWRDWNIFG_MASK              ((uint32_t)0x00000008U)         /* !< Clears PWRDWNIFG in RIS register */
#define DEBUGSS_ICLR_PWRDWNIFG_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define DEBUGSS_ICLR_PWRDWNIFG_CLR               ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to PWRUPIFG
                                                                                    is cleared */

/* DEBUGSS_SWCLK Bits */
/* DEBUGSS_SWCLK[PSTATE] Bits */
#define DEBUGSS_SWCLK_PSTATE_OFS                 (6)                             /* !< PSTATE Offset */
#define DEBUGSS_SWCLK_PSTATE_MASK                ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define DEBUGSS_SWCLK_PSTATE_UNASSIGNED          ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define DEBUGSS_SWCLK_PSTATE_HANDOVER            ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define DEBUGSS_SWCLK_PSTATE_CONC_NOT_LOCKED     ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWCLK_PSTATE_CONC_LOCKED         ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWCLK[GSTATE] Bits */
#define DEBUGSS_SWCLK_GSTATE_OFS                 (14)                            /* !< GSTATE Offset */
#define DEBUGSS_SWCLK_GSTATE_MASK                ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define DEBUGSS_SWCLK_GSTATE_UNASSIGNED          ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define DEBUGSS_SWCLK_GSTATE_HANDOVER            ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define DEBUGSS_SWCLK_GSTATE_CONC_NOT_LOCKED     ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWCLK_GSTATE_CONC_LOCKED         ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWCLK[PIPD] Bits */
#define DEBUGSS_SWCLK_PIPD_OFS                   (16)                            /* !< PIPD Offset */
#define DEBUGSS_SWCLK_PIPD_MASK                  ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define DEBUGSS_SWCLK_PIPD_NO_PULL_DOWN          ((uint32_t)0x00000000U)         /* !< No pull down */
#define DEBUGSS_SWCLK_PIPD_PULL_DOWN             ((uint32_t)0x00010000U)         /* !< Pull down */
/* DEBUGSS_SWCLK[PIPU] Bits */
#define DEBUGSS_SWCLK_PIPU_OFS                   (17)                            /* !< PIPU Offset */
#define DEBUGSS_SWCLK_PIPU_MASK                  ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define DEBUGSS_SWCLK_PIPU_NO_PULL_UP            ((uint32_t)0x00000000U)         /* !< No pull up */
#define DEBUGSS_SWCLK_PIPU_PULL_UP               ((uint32_t)0x00020000U)         /* !< Pull up */
/* DEBUGSS_SWCLK[INENA] Bits */
#define DEBUGSS_SWCLK_INENA_OFS                  (18)                            /* !< INENA Offset */
#define DEBUGSS_SWCLK_INENA_MASK                 ((uint32_t)0x00040000U)         /* !< Input enable */
#define DEBUGSS_SWCLK_INENA_INP_DISABLE          ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define DEBUGSS_SWCLK_INENA_INP_ENABLE           ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* DEBUGSS_SWCLK[HYSTEN] Bits */
#define DEBUGSS_SWCLK_HYSTEN_OFS                 (19)                            /* !< HYSTEN Offset */
#define DEBUGSS_SWCLK_HYSTEN_MASK                ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define DEBUGSS_SWCLK_HYSTEN_DIS_HYST            ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define DEBUGSS_SWCLK_HYSTEN_EN_HYST             ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* DEBUGSS_SWCLK[DRV] Bits */
#define DEBUGSS_SWCLK_DRV_OFS                    (20)                            /* !< DRV Offset */
#define DEBUGSS_SWCLK_DRV_MASK                   ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define DEBUGSS_SWCLK_DRV_STRENGTH_0             ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define DEBUGSS_SWCLK_DRV_STRENGTH_1             ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_2             ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_3             ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_4             ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_5             ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_6             ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define DEBUGSS_SWCLK_DRV_STRENGTH_7             ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* DEBUGSS_SWCLK[HIGHZ0] Bits */
#define DEBUGSS_SWCLK_HIGHZ0_OFS                 (24)                            /* !< HIGHZ0 Offset */
#define DEBUGSS_SWCLK_HIGHZ0_MASK                ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define DEBUGSS_SWCLK_HIGHZ0_DRV_LOW             ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define DEBUGSS_SWCLK_HIGHZ0_DRV_HIZ             ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* DEBUGSS_SWCLK[HIGHZ1] Bits */
#define DEBUGSS_SWCLK_HIGHZ1_OFS                 (25)                            /* !< HIGHZ1 Offset */
#define DEBUGSS_SWCLK_HIGHZ1_MASK                ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define DEBUGSS_SWCLK_HIGHZ1_DRV_HIGH            ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define DEBUGSS_SWCLK_HIGHZ1_DRV_HIZ             ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* DEBUGSS_SWCLK[INV] Bits */
#define DEBUGSS_SWCLK_INV_OFS                    (26)                            /* !< INV Offset */
#define DEBUGSS_SWCLK_INV_MASK                   ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define DEBUGSS_SWCLK_INV_NO_CHNG                ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define DEBUGSS_SWCLK_INV_CHNG                   ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* DEBUGSS_SWCLK[WUEN] Bits */
#define DEBUGSS_SWCLK_WUEN_OFS                   (27)                            /* !< WUEN Offset */
#define DEBUGSS_SWCLK_WUEN_MASK                  ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define DEBUGSS_SWCLK_WUEN_NO_WAKEUP             ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define DEBUGSS_SWCLK_WUEN_WAKEUP                ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* DEBUGSS_SWCLK[WCOMP] Bits */
#define DEBUGSS_SWCLK_WCOMP_OFS                  (28)                            /* !< WCOMP Offset */
#define DEBUGSS_SWCLK_WCOMP_MASK                 ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define DEBUGSS_SWCLK_WCOMP_MATCH_ZERO           ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define DEBUGSS_SWCLK_WCOMP_MATCH_ONE            ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

/* DEBUGSS_SWDIO Bits */
/* DEBUGSS_SWDIO[PSTATE] Bits */
#define DEBUGSS_SWDIO_PSTATE_OFS                 (6)                             /* !< PSTATE Offset */
#define DEBUGSS_SWDIO_PSTATE_MASK                ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define DEBUGSS_SWDIO_PSTATE_UNASSIGNED          ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define DEBUGSS_SWDIO_PSTATE_HANDOVER            ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define DEBUGSS_SWDIO_PSTATE_CONC_NOT_LOCKED     ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWDIO_PSTATE_CONC_LOCKED         ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWDIO[GSTATE] Bits */
#define DEBUGSS_SWDIO_GSTATE_OFS                 (14)                            /* !< GSTATE Offset */
#define DEBUGSS_SWDIO_GSTATE_MASK                ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define DEBUGSS_SWDIO_GSTATE_UNASSIGNED          ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define DEBUGSS_SWDIO_GSTATE_HANDOVER            ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define DEBUGSS_SWDIO_GSTATE_CONC_NOT_LOCKED     ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWDIO_GSTATE_CONC_LOCKED         ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWDIO[PIPD] Bits */
#define DEBUGSS_SWDIO_PIPD_OFS                   (16)                            /* !< PIPD Offset */
#define DEBUGSS_SWDIO_PIPD_MASK                  ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define DEBUGSS_SWDIO_PIPD_NO_PULL_DOWN          ((uint32_t)0x00000000U)         /* !< No pull down */
#define DEBUGSS_SWDIO_PIPD_PULL_DOWN             ((uint32_t)0x00010000U)         /* !< Pull down */
/* DEBUGSS_SWDIO[PIPU] Bits */
#define DEBUGSS_SWDIO_PIPU_OFS                   (17)                            /* !< PIPU Offset */
#define DEBUGSS_SWDIO_PIPU_MASK                  ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define DEBUGSS_SWDIO_PIPU_NO_PULL_UP            ((uint32_t)0x00000000U)         /* !< No pull up */
#define DEBUGSS_SWDIO_PIPU_PULL_UP               ((uint32_t)0x00020000U)         /* !< Pull up */
/* DEBUGSS_SWDIO[INENA] Bits */
#define DEBUGSS_SWDIO_INENA_OFS                  (18)                            /* !< INENA Offset */
#define DEBUGSS_SWDIO_INENA_MASK                 ((uint32_t)0x00040000U)         /* !< Input enable */
#define DEBUGSS_SWDIO_INENA_INP_DISABLE          ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define DEBUGSS_SWDIO_INENA_INP_ENABLE           ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* DEBUGSS_SWDIO[HYSTEN] Bits */
#define DEBUGSS_SWDIO_HYSTEN_OFS                 (19)                            /* !< HYSTEN Offset */
#define DEBUGSS_SWDIO_HYSTEN_MASK                ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define DEBUGSS_SWDIO_HYSTEN_DIS_HYST            ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define DEBUGSS_SWDIO_HYSTEN_EN_HYST             ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* DEBUGSS_SWDIO[DRV] Bits */
#define DEBUGSS_SWDIO_DRV_OFS                    (20)                            /* !< DRV Offset */
#define DEBUGSS_SWDIO_DRV_MASK                   ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define DEBUGSS_SWDIO_DRV_STRENGTH_0             ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define DEBUGSS_SWDIO_DRV_STRENGTH_1             ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_2             ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_3             ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_4             ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_5             ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_6             ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define DEBUGSS_SWDIO_DRV_STRENGTH_7             ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* DEBUGSS_SWDIO[HIGHZ0] Bits */
#define DEBUGSS_SWDIO_HIGHZ0_OFS                 (24)                            /* !< HIGHZ0 Offset */
#define DEBUGSS_SWDIO_HIGHZ0_MASK                ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define DEBUGSS_SWDIO_HIGHZ0_DRV_LOW             ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define DEBUGSS_SWDIO_HIGHZ0_DRV_HIZ             ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* DEBUGSS_SWDIO[HIGHZ1] Bits */
#define DEBUGSS_SWDIO_HIGHZ1_OFS                 (25)                            /* !< HIGHZ1 Offset */
#define DEBUGSS_SWDIO_HIGHZ1_MASK                ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define DEBUGSS_SWDIO_HIGHZ1_DRV_HIGH            ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define DEBUGSS_SWDIO_HIGHZ1_DRV_HIZ             ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* DEBUGSS_SWDIO[INV] Bits */
#define DEBUGSS_SWDIO_INV_OFS                    (26)                            /* !< INV Offset */
#define DEBUGSS_SWDIO_INV_MASK                   ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define DEBUGSS_SWDIO_INV_NO_CHNG                ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define DEBUGSS_SWDIO_INV_CHNG                   ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* DEBUGSS_SWDIO[WUEN] Bits */
#define DEBUGSS_SWDIO_WUEN_OFS                   (27)                            /* !< WUEN Offset */
#define DEBUGSS_SWDIO_WUEN_MASK                  ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define DEBUGSS_SWDIO_WUEN_NO_WAKEUP             ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define DEBUGSS_SWDIO_WUEN_WAKEUP                ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* DEBUGSS_SWDIO[WCOMP] Bits */
#define DEBUGSS_SWDIO_WCOMP_OFS                  (28)                            /* !< WCOMP Offset */
#define DEBUGSS_SWDIO_WCOMP_MASK                 ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define DEBUGSS_SWDIO_WCOMP_MATCH_ZERO           ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define DEBUGSS_SWDIO_WCOMP_MATCH_ONE            ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

