TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_debugss.h
/* DEBUGSS_SWCLK_ALT Bits */
/* DEBUGSS_SWCLK_ALT[PSTATE] Bits */
#define DEBUGSS_SWCLK_ALT_PSTATE_OFS             (6)                             /* !< PSTATE Offset */
#define DEBUGSS_SWCLK_ALT_PSTATE_MASK            ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define DEBUGSS_SWCLK_ALT_PSTATE_UNASSIGNED      ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define DEBUGSS_SWCLK_ALT_PSTATE_HANDOVER        ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define DEBUGSS_SWCLK_ALT_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWCLK_ALT_PSTATE_CONC_LOCKED     ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWCLK_ALT[GSTATE] Bits */
#define DEBUGSS_SWCLK_ALT_GSTATE_OFS             (14)                            /* !< GSTATE Offset */
#define DEBUGSS_SWCLK_ALT_GSTATE_MASK            ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define DEBUGSS_SWCLK_ALT_GSTATE_UNASSIGNED      ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define DEBUGSS_SWCLK_ALT_GSTATE_HANDOVER        ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define DEBUGSS_SWCLK_ALT_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWCLK_ALT_GSTATE_CONC_LOCKED     ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWCLK_ALT[PIPD] Bits */
#define DEBUGSS_SWCLK_ALT_PIPD_OFS               (16)                            /* !< PIPD Offset */
#define DEBUGSS_SWCLK_ALT_PIPD_MASK              ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define DEBUGSS_SWCLK_ALT_PIPD_NO_PULL_DOWN      ((uint32_t)0x00000000U)         /* !< No pull down */
#define DEBUGSS_SWCLK_ALT_PIPD_PULL_DOWN         ((uint32_t)0x00010000U)         /* !< Pull down */
/* DEBUGSS_SWCLK_ALT[PIPU] Bits */
#define DEBUGSS_SWCLK_ALT_PIPU_OFS               (17)                            /* !< PIPU Offset */
#define DEBUGSS_SWCLK_ALT_PIPU_MASK              ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define DEBUGSS_SWCLK_ALT_PIPU_NO_PULL_UP        ((uint32_t)0x00000000U)         /* !< No pull up */
#define DEBUGSS_SWCLK_ALT_PIPU_PULL_UP           ((uint32_t)0x00020000U)         /* !< Pull up */
/* DEBUGSS_SWCLK_ALT[INENA] Bits */
#define DEBUGSS_SWCLK_ALT_INENA_OFS              (18)                            /* !< INENA Offset */
#define DEBUGSS_SWCLK_ALT_INENA_MASK             ((uint32_t)0x00040000U)         /* !< Input enable */
#define DEBUGSS_SWCLK_ALT_INENA_INP_DISABLE      ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define DEBUGSS_SWCLK_ALT_INENA_INP_ENABLE       ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* DEBUGSS_SWCLK_ALT[HYSTEN] Bits */
#define DEBUGSS_SWCLK_ALT_HYSTEN_OFS             (19)                            /* !< HYSTEN Offset */
#define DEBUGSS_SWCLK_ALT_HYSTEN_MASK            ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define DEBUGSS_SWCLK_ALT_HYSTEN_DIS_HYST        ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define DEBUGSS_SWCLK_ALT_HYSTEN_EN_HYST         ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* DEBUGSS_SWCLK_ALT[DRV] Bits */
#define DEBUGSS_SWCLK_ALT_DRV_OFS                (20)                            /* !< DRV Offset */
#define DEBUGSS_SWCLK_ALT_DRV_MASK               ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_0         ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_1         ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_2         ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_3         ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_4         ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_5         ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_6         ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define DEBUGSS_SWCLK_ALT_DRV_STRENGTH_7         ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* DEBUGSS_SWCLK_ALT[HIGHZ0] Bits */
#define DEBUGSS_SWCLK_ALT_HIGHZ0_OFS             (24)                            /* !< HIGHZ0 Offset */
#define DEBUGSS_SWCLK_ALT_HIGHZ0_MASK            ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define DEBUGSS_SWCLK_ALT_HIGHZ0_DRV_LOW         ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define DEBUGSS_SWCLK_ALT_HIGHZ0_DRV_HIZ         ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* DEBUGSS_SWCLK_ALT[HIGHZ1] Bits */
#define DEBUGSS_SWCLK_ALT_HIGHZ1_OFS             (25)                            /* !< HIGHZ1 Offset */
#define DEBUGSS_SWCLK_ALT_HIGHZ1_MASK            ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define DEBUGSS_SWCLK_ALT_HIGHZ1_DRV_HIGH        ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define DEBUGSS_SWCLK_ALT_HIGHZ1_DRV_HIZ         ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* DEBUGSS_SWCLK_ALT[INV] Bits */
#define DEBUGSS_SWCLK_ALT_INV_OFS                (26)                            /* !< INV Offset */
#define DEBUGSS_SWCLK_ALT_INV_MASK               ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define DEBUGSS_SWCLK_ALT_INV_NO_CHNG            ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define DEBUGSS_SWCLK_ALT_INV_CHNG               ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* DEBUGSS_SWCLK_ALT[WUEN] Bits */
#define DEBUGSS_SWCLK_ALT_WUEN_OFS               (27)                            /* !< WUEN Offset */
#define DEBUGSS_SWCLK_ALT_WUEN_MASK              ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define DEBUGSS_SWCLK_ALT_WUEN_NO_WAKEUP         ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define DEBUGSS_SWCLK_ALT_WUEN_WAKEUP            ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* DEBUGSS_SWCLK_ALT[WCOMP] Bits */
#define DEBUGSS_SWCLK_ALT_WCOMP_OFS              (28)                            /* !< WCOMP Offset */
#define DEBUGSS_SWCLK_ALT_WCOMP_MASK             ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define DEBUGSS_SWCLK_ALT_WCOMP_MATCH_ZERO       ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define DEBUGSS_SWCLK_ALT_WCOMP_MATCH_ONE        ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

/* DEBUGSS_SWDIO_ALT Bits */
/* DEBUGSS_SWDIO_ALT[PSTATE] Bits */
#define DEBUGSS_SWDIO_ALT_PSTATE_OFS             (6)                             /* !< PSTATE Offset */
#define DEBUGSS_SWDIO_ALT_PSTATE_MASK            ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define DEBUGSS_SWDIO_ALT_PSTATE_UNASSIGNED      ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define DEBUGSS_SWDIO_ALT_PSTATE_HANDOVER        ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define DEBUGSS_SWDIO_ALT_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWDIO_ALT_PSTATE_CONC_LOCKED     ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWDIO_ALT[GSTATE] Bits */
#define DEBUGSS_SWDIO_ALT_GSTATE_OFS             (14)                            /* !< GSTATE Offset */
#define DEBUGSS_SWDIO_ALT_GSTATE_MASK            ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define DEBUGSS_SWDIO_ALT_GSTATE_UNASSIGNED      ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define DEBUGSS_SWDIO_ALT_GSTATE_HANDOVER        ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define DEBUGSS_SWDIO_ALT_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channel is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define DEBUGSS_SWDIO_ALT_GSTATE_CONC_LOCKED     ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* DEBUGSS_SWDIO_ALT[PIPD] Bits */
#define DEBUGSS_SWDIO_ALT_PIPD_OFS               (16)                            /* !< PIPD Offset */
#define DEBUGSS_SWDIO_ALT_PIPD_MASK              ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define DEBUGSS_SWDIO_ALT_PIPD_NO_PULL_DOWN      ((uint32_t)0x00000000U)         /* !< No pull down */
#define DEBUGSS_SWDIO_ALT_PIPD_PULL_DOWN         ((uint32_t)0x00010000U)         /* !< Pull down */
/* DEBUGSS_SWDIO_ALT[PIPU] Bits */
#define DEBUGSS_SWDIO_ALT_PIPU_OFS               (17)                            /* !< PIPU Offset */
#define DEBUGSS_SWDIO_ALT_PIPU_MASK              ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define DEBUGSS_SWDIO_ALT_PIPU_NO_PULL_UP        ((uint32_t)0x00000000U)         /* !< No pull up */
#define DEBUGSS_SWDIO_ALT_PIPU_PULL_UP           ((uint32_t)0x00020000U)         /* !< Pull up */
/* DEBUGSS_SWDIO_ALT[INENA] Bits */
#define DEBUGSS_SWDIO_ALT_INENA_OFS              (18)                            /* !< INENA Offset */
#define DEBUGSS_SWDIO_ALT_INENA_MASK             ((uint32_t)0x00040000U)         /* !< Input enable */
#define DEBUGSS_SWDIO_ALT_INENA_INP_DISABLE      ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define DEBUGSS_SWDIO_ALT_INENA_INP_ENABLE       ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* DEBUGSS_SWDIO_ALT[HYSTEN] Bits */
#define DEBUGSS_SWDIO_ALT_HYSTEN_OFS             (19)                            /* !< HYSTEN Offset */
#define DEBUGSS_SWDIO_ALT_HYSTEN_MASK            ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define DEBUGSS_SWDIO_ALT_HYSTEN_DIS_HYST        ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define DEBUGSS_SWDIO_ALT_HYSTEN_EN_HYST         ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* DEBUGSS_SWDIO_ALT[DRV] Bits */
#define DEBUGSS_SWDIO_ALT_DRV_OFS                (20)                            /* !< DRV Offset */
#define DEBUGSS_SWDIO_ALT_DRV_MASK               ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_0         ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_1         ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_2         ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_3         ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_4         ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_5         ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_6         ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define DEBUGSS_SWDIO_ALT_DRV_STRENGTH_7         ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* DEBUGSS_SWDIO_ALT[HIGHZ0] Bits */
#define DEBUGSS_SWDIO_ALT_HIGHZ0_OFS             (24)                            /* !< HIGHZ0 Offset */
#define DEBUGSS_SWDIO_ALT_HIGHZ0_MASK            ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define DEBUGSS_SWDIO_ALT_HIGHZ0_DRV_LOW         ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define DEBUGSS_SWDIO_ALT_HIGHZ0_DRV_HIZ         ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* DEBUGSS_SWDIO_ALT[HIGHZ1] Bits */
#define DEBUGSS_SWDIO_ALT_HIGHZ1_OFS             (25)                            /* !< HIGHZ1 Offset */
#define DEBUGSS_SWDIO_ALT_HIGHZ1_MASK            ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define DEBUGSS_SWDIO_ALT_HIGHZ1_DRV_HIGH        ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define DEBUGSS_SWDIO_ALT_HIGHZ1_DRV_HIZ         ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* DEBUGSS_SWDIO_ALT[INV] Bits */
#define DEBUGSS_SWDIO_ALT_INV_OFS                (26)                            /* !< INV Offset */
#define DEBUGSS_SWDIO_ALT_INV_MASK               ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define DEBUGSS_SWDIO_ALT_INV_NO_CHNG            ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define DEBUGSS_SWDIO_ALT_INV_CHNG               ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* DEBUGSS_SWDIO_ALT[WUEN] Bits */
#define DEBUGSS_SWDIO_ALT_WUEN_OFS               (27)                            /* !< WUEN Offset */
#define DEBUGSS_SWDIO_ALT_WUEN_MASK              ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define DEBUGSS_SWDIO_ALT_WUEN_NO_WAKEUP         ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define DEBUGSS_SWDIO_ALT_WUEN_WAKEUP            ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* DEBUGSS_SWDIO_ALT[WCOMP] Bits */
#define DEBUGSS_SWDIO_ALT_WCOMP_OFS              (28)                            /* !< WCOMP Offset */
#define DEBUGSS_SWDIO_ALT_WCOMP_MASK             ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define DEBUGSS_SWDIO_ALT_WCOMP_MATCH_ZERO       ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define DEBUGSS_SWDIO_ALT_WCOMP_MATCH_ONE        ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

