TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_debugss.h
/* DEBUGSS_SPECIAL_AUTH_SET Bits */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_SECAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SECAPEN_OFS (0)                             /* !< SET_SECAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SECAPEN_MASK ((uint32_t)0x00000001U)         /* !< This bit sets SECAPEN bit in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SECAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SECAPEN_SET ((uint32_t)0x00000001U)         /* !< Set SECAPEN */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_SWDPORTEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SWDPORTEN_OFS (1)                             /* !< SET_SWDPORTEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SWDPORTEN_MASK ((uint32_t)0x00000002U)         /* !< This bit sets SWDPORTEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SWDPORTEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_SWDPORTEN_SET ((uint32_t)0x00000002U)         /* !< Set SWDPORTEN */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_DFTAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_DFTAPEN_OFS (2)                             /* !< SET_DFTAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_DFTAPEN_MASK ((uint32_t)0x00000004U)         /* !< This bit sets DFTAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_DFTAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_DFTAPEN_SET ((uint32_t)0x00000004U)         /* !< Set DFTTAPEN */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_ETAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_ETAPEN_OFS  (3)                             /* !< SET_ETAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_ETAPEN_MASK ((uint32_t)0x00000008U)         /* !< This bit sets ETAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_ETAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_ETAPEN_SET  ((uint32_t)0x00000008U)         /* !< Set ETAPEN */
/* DEBUGSS_SPECIAL_AUTH_SET[KEY] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_KEY_OFS         (24)                            /* !< KEY Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_KEY_MASK        ((uint32_t)0xFF000000U)         /* !< This field must be written with
                                                                                    0xA5 to be able to set any of the
                                                                                    enable bits. */
#define DEBUGSS_SPECIAL_AUTH_SET_KEY_UNLOCK_W    ((uint32_t)0xA5000000U)         /* !< This field must be written with
                                                                                    0xA5 to be able to set any of the
                                                                                    enable bits */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_AHBAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_AHBAPEN_OFS (5)                             /* !< SET_AHBAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_AHBAPEN_MASK ((uint32_t)0x00000020U)         /* !< This bit sets AHBAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_AHBAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_AHBAPEN_SET ((uint32_t)0x00000020U)         /* !< Set AHBAPEN */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_CFGAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_CFGAPEN_OFS (4)                             /* !< SET_CFGAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_CFGAPEN_MASK ((uint32_t)0x00000010U)         /* !< This bit sets CFGAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_CFGAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_CFGAPEN_SET ((uint32_t)0x00000010U)         /* !< Set CFGAPEN */
/* DEBUGSS_SPECIAL_AUTH_SET[SET_PWRAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_PWRAPEN_OFS (6)                             /* !< SET_PWRAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_PWRAPEN_MASK ((uint32_t)0x00000040U)         /* !< This bit sets PWRAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_PWRAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_SET_SET_PWRAPEN_SET ((uint32_t)0x00000040U)         /* !< Set PWRAPEN */

/* DEBUGSS_SPECIAL_AUTH_CLR Bits */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_SECAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SECAPEN_OFS (0)                             /* !< CLR_SECAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SECAPEN_MASK ((uint32_t)0x00000001U)         /* !< This bit clears SECAPEN bit in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SECAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SECAPEN_CLR ((uint32_t)0x00000001U)         /* !< Clear SECAPEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_SWDPORTEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SWDPORTEN_OFS (1)                             /* !< CLR_SWDPORTEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SWDPORTEN_MASK ((uint32_t)0x00000002U)         /* !< This bit clears SWDPORTEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SWDPORTEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_SWDPORTEN_CLR ((uint32_t)0x00000002U)         /* !< Clears SWDPORTEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_DFTAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_DFTAPEN_OFS (2)                             /* !< CLR_DFTAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_DFTAPEN_MASK ((uint32_t)0x00000004U)         /* !< This bit clears DFTTAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_DFTAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_DFTAPEN_CLR ((uint32_t)0x00000004U)         /* !< Clear DFTTAPEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_ETAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_ETAPEN_OFS  (3)                             /* !< CLR_ETAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_ETAPEN_MASK ((uint32_t)0x00000008U)         /* !< This bit clears ETAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_ETAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_ETAPEN_CLR  ((uint32_t)0x00000008U)         /* !< Clear ETAPEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[KEY] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_KEY_OFS         (24)                            /* !< KEY Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_KEY_MASK        ((uint32_t)0xFF000000U)         /* !< This field must be written with
                                                                                    0x22 to be able to clear any of the
                                                                                    enable bits. */
#define DEBUGSS_SPECIAL_AUTH_CLR_KEY_UNLOCK_W    ((uint32_t)0x22000000U)         /* !< This field must be written with
                                                                                    0x22 to be able to clear any of the
                                                                                    enable bits */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_AHBAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_AHBAPEN_OFS (5)                             /* !< CLR_AHBAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_AHBAPEN_MASK ((uint32_t)0x00000020U)         /* !< This bit clears AHBAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_AHBAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_AHBAPEN_CLR ((uint32_t)0x00000020U)         /* !< Clear AHBAPEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_CFGAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_CFGAPEN_OFS (4)                             /* !< CLR_CFGAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_CFGAPEN_MASK ((uint32_t)0x00000010U)         /* !< This bit clears CFGAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_CFGAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_CFGAPEN_CLR ((uint32_t)0x00000010U)         /* !< Clear CFGAPEN */
/* DEBUGSS_SPECIAL_AUTH_CLR[CLR_PWRAPEN] Bits */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_PWRAPEN_OFS (6)                             /* !< CLR_PWRAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_PWRAPEN_MASK ((uint32_t)0x00000040U)         /* !< This bit clears PWRAPEN in
                                                                                    SPECIAL_AUTH register. */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_PWRAPEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_SPECIAL_AUTH_CLR_CLR_PWRAPEN_CLR ((uint32_t)0x00000040U)         /* !< Clear PWRAPEN */

/* DEBUGSS_APP_AUTH Bits */
/* DEBUGSS_APP_AUTH[DBGEN] Bits */
#define DEBUGSS_APP_AUTH_DBGEN_OFS               (0)                             /* !< DBGEN Offset */
#define DEBUGSS_APP_AUTH_DBGEN_MASK              ((uint32_t)0x00000001U)         /* !< Controls invasive debug enable. */
#define DEBUGSS_APP_AUTH_DBGEN_DISABLE           ((uint32_t)0x00000000U)         /* !< Invasive debug disabled */
#define DEBUGSS_APP_AUTH_DBGEN_ENABLE            ((uint32_t)0x00000001U)         /* !< Invasive debug enabled */
/* DEBUGSS_APP_AUTH[NIDEN] Bits */
#define DEBUGSS_APP_AUTH_NIDEN_OFS               (1)                             /* !< NIDEN Offset */
#define DEBUGSS_APP_AUTH_NIDEN_MASK              ((uint32_t)0x00000002U)         /* !< Controls non-invasive debug enable. */
#define DEBUGSS_APP_AUTH_NIDEN_DISABLE           ((uint32_t)0x00000000U)         /* !< Non-invasive debug disabled */
#define DEBUGSS_APP_AUTH_NIDEN_ENABLE            ((uint32_t)0x00000002U)         /* !< Non-invasive debug enabled */
/* DEBUGSS_APP_AUTH[SPIDEN] Bits */
#define DEBUGSS_APP_AUTH_SPIDEN_OFS              (2)                             /* !< SPIDEN Offset */
#define DEBUGSS_APP_AUTH_SPIDEN_MASK             ((uint32_t)0x00000004U)         /* !< Secure invasive debug enable. */
#define DEBUGSS_APP_AUTH_SPIDEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Invasive debug disabled */
#define DEBUGSS_APP_AUTH_SPIDEN_ENABLE           ((uint32_t)0x00000004U)         /* !< Invasive debug enabled */
/* DEBUGSS_APP_AUTH[SPNIDEN] Bits */
#define DEBUGSS_APP_AUTH_SPNIDEN_OFS             (3)                             /* !< SPNIDEN Offset */
#define DEBUGSS_APP_AUTH_SPNIDEN_MASK            ((uint32_t)0x00000008U)         /* !< Secure non-invasive debug enable. */
#define DEBUGSS_APP_AUTH_SPNIDEN_DISABLE         ((uint32_t)0x00000000U)         /* !< Invasive debug disabled */
#define DEBUGSS_APP_AUTH_SPNIDEN_ENABLE          ((uint32_t)0x00000008U)         /* !< Invasive debug enabled */

/* DEBUGSS_APP_AUTH_SET Bits */
/* DEBUGSS_APP_AUTH_SET[SET_DBGEN] Bits */
#define DEBUGSS_APP_AUTH_SET_SET_DBGEN_OFS       (0)                             /* !< SET_DBGEN Offset */
#define DEBUGSS_APP_AUTH_SET_SET_DBGEN_MASK      ((uint32_t)0x00000001U)         /* !< Sets DBGEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_SET_SET_DBGEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_SET_SET_DBGEN_SET       ((uint32_t)0x00000001U)         /* !< Sets DBGEN */
/* DEBUGSS_APP_AUTH_SET[SET_NIDEN] Bits */
#define DEBUGSS_APP_AUTH_SET_SET_NIDEN_OFS       (1)                             /* !< SET_NIDEN Offset */
#define DEBUGSS_APP_AUTH_SET_SET_NIDEN_MASK      ((uint32_t)0x00000002U)         /* !< Sets NIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_SET_SET_NIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_SET_SET_NIDEN_SET       ((uint32_t)0x00000002U)         /* !< Sets NIDEN */
/* DEBUGSS_APP_AUTH_SET[KEY] Bits */
#define DEBUGSS_APP_AUTH_SET_KEY_OFS             (24)                            /* !< KEY Offset */
#define DEBUGSS_APP_AUTH_SET_KEY_MASK            ((uint32_t)0xFF000000U)         /* !< This field must be written with
                                                                                    0x39 to be able to set any of the
                                                                                    enable bits. */
#define DEBUGSS_APP_AUTH_SET_KEY_UNLOCK_W        ((uint32_t)0x39000000U)         /* !< This field must be written with
                                                                                    0x39 to be able to clear any of the
                                                                                    enable bits */
/* DEBUGSS_APP_AUTH_SET[SET_SPIDEN] Bits */
#define DEBUGSS_APP_AUTH_SET_SET_SPIDEN_OFS      (2)                             /* !< SET_SPIDEN Offset */
#define DEBUGSS_APP_AUTH_SET_SET_SPIDEN_MASK     ((uint32_t)0x00000004U)         /* !< Sets SPIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_SET_SET_SPIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_SET_SET_SPIDEN_SET      ((uint32_t)0x00000004U)         /* !< Sets NIDEN */
/* DEBUGSS_APP_AUTH_SET[SET_SPNIDEN] Bits */
#define DEBUGSS_APP_AUTH_SET_SET_SPNIDEN_OFS     (3)                             /* !< SET_SPNIDEN Offset */
#define DEBUGSS_APP_AUTH_SET_SET_SPNIDEN_MASK    ((uint32_t)0x00000008U)         /* !< Sets SPNIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_SET_SET_SPNIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_SET_SET_SPNIDEN_SET     ((uint32_t)0x00000008U)         /* !< Sets NIDEN */

