TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/m33/hw_debugss.h
/* DEBUGSS_APP_AUTH_CLR Bits */
/* DEBUGSS_APP_AUTH_CLR[CLR_DBGEN] Bits */
#define DEBUGSS_APP_AUTH_CLR_CLR_DBGEN_OFS       (0)                             /* !< CLR_DBGEN Offset */
#define DEBUGSS_APP_AUTH_CLR_CLR_DBGEN_MASK      ((uint32_t)0x00000001U)         /* !< Clears DBGEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_CLR_CLR_DBGEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_CLR_CLR_DBGEN_CLR       ((uint32_t)0x00000001U)         /* !< Clears DBGEN */
/* DEBUGSS_APP_AUTH_CLR[CLR_NIDEN] Bits */
#define DEBUGSS_APP_AUTH_CLR_CLR_NIDEN_OFS       (1)                             /* !< CLR_NIDEN Offset */
#define DEBUGSS_APP_AUTH_CLR_CLR_NIDEN_MASK      ((uint32_t)0x00000002U)         /* !< Clears NIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_CLR_CLR_NIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_CLR_CLR_NIDEN_CLR       ((uint32_t)0x00000002U)         /* !< Clears NIDEN */
/* DEBUGSS_APP_AUTH_CLR[KEY] Bits */
#define DEBUGSS_APP_AUTH_CLR_KEY_OFS             (24)                            /* !< KEY Offset */
#define DEBUGSS_APP_AUTH_CLR_KEY_MASK            ((uint32_t)0xFF000000U)         /* !< This field must be written with
                                                                                    0x7D to be able to clear any of the
                                                                                    enable bits. */
#define DEBUGSS_APP_AUTH_CLR_KEY_UNLOCK_W        ((uint32_t)0x7D000000U)         /* !< This field must be written with
                                                                                    0x7d to be able to clear any of the
                                                                                    enable bits */
/* DEBUGSS_APP_AUTH_CLR[CLR_SPIDEN] Bits */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPIDEN_OFS      (2)                             /* !< CLR_SPIDEN Offset */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPIDEN_MASK     ((uint32_t)0x00000004U)         /* !< Clears SPIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPIDEN_SET      ((uint32_t)0x00000004U)         /* !< Sets NIDEN */
/* DEBUGSS_APP_AUTH_CLR[CLR_SPNIDEN] Bits */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPNIDEN_OFS     (3)                             /* !< CLR_SPNIDEN Offset */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPNIDEN_MASK    ((uint32_t)0x00000008U)         /* !< Clears SPNIDEN bit in APPCPU0_AUTH
                                                                                    register. */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPNIDEN_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define DEBUGSS_APP_AUTH_CLR_CLR_SPNIDEN_SET     ((uint32_t)0x00000008U)         /* !< Sets NIDEN */

/* DEBUGSS_DEVICEID Bits */
/* DEBUGSS_DEVICEID[PRESENT] Bits */
#define DEBUGSS_DEVICEID_PRESENT_OFS             (0)                             /* !< PRESENT Offset */
#define DEBUGSS_DEVICEID_PRESENT_MASK            ((uint32_t)0x00000001U)         /* !< The value of 1 in bit 0 of the
                                                                                    device identification register means
                                                                                    the device idetifiaction is present. */
#define DEBUGSS_DEVICEID_PRESENT_NOK             ((uint32_t)0x00000000U)         /* !< Not-Okay. The Device-ID is not
                                                                                    present. */
#define DEBUGSS_DEVICEID_PRESENT_OK              ((uint32_t)0x00000001U)         /* !< Okay. The Device-ID is present. */
/* DEBUGSS_DEVICEID[MANUFACTURER] Bits */
#define DEBUGSS_DEVICEID_MANUFACTURER_OFS        (1)                             /* !< MANUFACTURER Offset */
#define DEBUGSS_DEVICEID_MANUFACTURER_MASK       ((uint32_t)0x00000FFEU)         /* !< TI's JEDEC bank and company code,
                                                                                    which is 00000010111b. */
#define DEBUGSS_DEVICEID_MANUFACTURER_TIJEDEC    ((uint32_t)0x0000002EU)         /* !< TI's JDEC ID */
/* DEBUGSS_DEVICEID[PARTNUM] Bits */
#define DEBUGSS_DEVICEID_PARTNUM_OFS             (12)                            /* !< PARTNUM Offset */
#define DEBUGSS_DEVICEID_PARTNUM_MASK            ((uint32_t)0x0FFFF000U)         /* !< Part number of the device. */
#define DEBUGSS_DEVICEID_PARTNUM_MIN             ((uint32_t)0x00000000U)         /* !< Minimum part number */
#define DEBUGSS_DEVICEID_PARTNUM_MAX             ((uint32_t)0x0FFFF000U)         /* !< Maximum part number */
/* DEBUGSS_DEVICEID[VERSION] Bits */
#define DEBUGSS_DEVICEID_VERSION_OFS             (28)                            /* !< VERSION Offset */
#define DEBUGSS_DEVICEID_VERSION_MASK            ((uint32_t)0xF0000000U)         /* !< Revision of the device. */
#define DEBUGSS_DEVICEID_VERSION_MIN             ((uint32_t)0x00000000U)         /* !< Minimum revision */
#define DEBUGSS_DEVICEID_VERSION_MAX             ((uint32_t)0xF0000000U)         /* !< Maximium revision */

/* DEBUGSS_USERID Bits */
/* DEBUGSS_USERID[PART] Bits */
#define DEBUGSS_USERID_PART_OFS                  (0)                             /* !< PART Offset */
#define DEBUGSS_USERID_PART_MASK                 ((uint32_t)0x0000FFFFU)         /* !< Bit pattern that uniquely
                                                                                    identifies the part. */
#define DEBUGSS_USERID_PART_MIN                  ((uint32_t)0x00000000U)         /* !< Minimum part number */
#define DEBUGSS_USERID_PART_MAX                  ((uint32_t)0x0000FFFFU)         /* !< Maximum part number */
/* DEBUGSS_USERID[VARIANT] Bits */
#define DEBUGSS_USERID_VARIANT_OFS               (16)                            /* !< VARIANT Offset */
#define DEBUGSS_USERID_VARIANT_MASK              ((uint32_t)0x00FF0000U)         /* !< Bit pattern uniqueley identifies
                                                                                    the variant of the part. */
#define DEBUGSS_USERID_VARIANT_MIN               ((uint32_t)0x00000000U)         /* !< Minimum variant */
#define DEBUGSS_USERID_VARIANT_MAX               ((uint32_t)0x00FF0000U)         /* !< Maximum variant */
/* DEBUGSS_USERID[MINORREV] Bits */
#define DEBUGSS_USERID_MINORREV_OFS              (24)                            /* !< MINORREV Offset */
#define DEBUGSS_USERID_MINORREV_MASK             ((uint32_t)0x0F000000U)         /* !< Monotonic increasing value
                                                                                    indicating a new revision of the
                                                                                    device that preservs compatibility
                                                                                    with lesser minorrev values. */
#define DEBUGSS_USERID_MINORREV_MIN              ((uint32_t)0x00000000U)         /* !< Minimum minor revision */
#define DEBUGSS_USERID_MINORREV_MAX              ((uint32_t)0x0F000000U)         /* !< Maximum minor revision */
/* DEBUGSS_USERID[MAJORREV] Bits */
#define DEBUGSS_USERID_MAJORREV_OFS              (28)                            /* !< MAJORREV Offset */
#define DEBUGSS_USERID_MAJORREV_MASK             ((uint32_t)0x70000000U)         /* !< Monotonic increasing value
                                                                                    indicating a new revision of the
                                                                                    device significant enough that users
                                                                                    of the device may have to revise PCB
                                                                                    or software design. */
#define DEBUGSS_USERID_MAJORREV_MIN              ((uint32_t)0x00000000U)         /* !< Minimum major revision */
#define DEBUGSS_USERID_MAJORREV_MAX              ((uint32_t)0x70000000U)         /* !< Maximum major revision */
/* DEBUGSS_USERID[START] Bits */
#define DEBUGSS_USERID_START_OFS                 (31)                            /* !< START Offset */
#define DEBUGSS_USERID_START_MASK                ((uint32_t)0x80000000U)         /* !< Start bit. A value of 1 indicates
                                                                                    the USERID is present. */
#define DEBUGSS_USERID_START_NOK                 ((uint32_t)0x00000000U)         /* !< Not-Okay. The User-ID is not
                                                                                    defined. */
#define DEBUGSS_USERID_START_OK                  ((uint32_t)0x80000000U)         /* !< Okay. Start of the User-ID */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_m33_hw_debugss__include */

